MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F207ZE/mcu.h
/******************  Bit definition for FSMC_ECCR2 register  ******************/
#define FSMC_ECCR2_ECC2_Pos          (0U)                                      
#define FSMC_ECCR2_ECC2_Msk          (0xFFFFFFFFUL << FSMC_ECCR2_ECC2_Pos)      /*!< 0xFFFFFFFF */
#define FSMC_ECCR2_ECC2              FSMC_ECCR2_ECC2_Msk                       /*!<ECC result */

/******************  Bit definition for FSMC_ECCR3 register  ******************/
#define FSMC_ECCR3_ECC3_Pos          (0U)                                      
#define FSMC_ECCR3_ECC3_Msk          (0xFFFFFFFFUL << FSMC_ECCR3_ECC3_Pos)      /*!< 0xFFFFFFFF */
#define FSMC_ECCR3_ECC3              FSMC_ECCR3_ECC3_Msk                       /*!<ECC result */

/******************************************************************************/
/*                                                                            */
/*                            General Purpose I/O                             */
/*                                                                            */
/******************************************************************************/
/******************  Bits definition for GPIO_MODER register  *****************/
#define GPIO_MODER_MODE0                    0x00000003U
#define GPIO_MODER_MODE0_0                  0x00000001U
#define GPIO_MODER_MODE0_1                  0x00000002U
#define GPIO_MODER_MODE1                    0x0000000CU
#define GPIO_MODER_MODE1_0                  0x00000004U
#define GPIO_MODER_MODE1_1                  0x00000008U
#define GPIO_MODER_MODE2                    0x00000030U
#define GPIO_MODER_MODE2_0                  0x00000010U
#define GPIO_MODER_MODE2_1                  0x00000020U
#define GPIO_MODER_MODE3                    0x000000C0U
#define GPIO_MODER_MODE3_0                  0x00000040U
#define GPIO_MODER_MODE3_1                  0x00000080U
#define GPIO_MODER_MODE4                    0x00000300U
#define GPIO_MODER_MODE4_0                  0x00000100U
#define GPIO_MODER_MODE4_1                  0x00000200U
#define GPIO_MODER_MODE5                    0x00000C00U
#define GPIO_MODER_MODE5_0                  0x00000400U
#define GPIO_MODER_MODE5_1                  0x00000800U
#define GPIO_MODER_MODE6                    0x00003000U
#define GPIO_MODER_MODE6_0                  0x00001000U
#define GPIO_MODER_MODE6_1                  0x00002000U
#define GPIO_MODER_MODE7                    0x0000C000U
#define GPIO_MODER_MODE7_0                  0x00004000U
#define GPIO_MODER_MODE7_1                  0x00008000U
#define GPIO_MODER_MODE8                    0x00030000U
#define GPIO_MODER_MODE8_0                  0x00010000U
#define GPIO_MODER_MODE8_1                  0x00020000U
#define GPIO_MODER_MODE9                    0x000C0000U
#define GPIO_MODER_MODE9_0                  0x00040000U
#define GPIO_MODER_MODE9_1                  0x00080000U
#define GPIO_MODER_MODE10                   0x00300000U
#define GPIO_MODER_MODE10_0                 0x00100000U
#define GPIO_MODER_MODE10_1                 0x00200000U
#define GPIO_MODER_MODE11                   0x00C00000U
#define GPIO_MODER_MODE11_0                 0x00400000U
#define GPIO_MODER_MODE11_1                 0x00800000U
#define GPIO_MODER_MODE12                   0x03000000U
#define GPIO_MODER_MODE12_0                 0x01000000U
#define GPIO_MODER_MODE12_1                 0x02000000U
#define GPIO_MODER_MODE13                   0x0C000000U
#define GPIO_MODER_MODE13_0                 0x04000000U
#define GPIO_MODER_MODE13_1                 0x08000000U
#define GPIO_MODER_MODE14                   0x30000000U
#define GPIO_MODER_MODE14_0                 0x10000000U
#define GPIO_MODER_MODE14_1                 0x20000000U
#define GPIO_MODER_MODE15                   0xC0000000U
#define GPIO_MODER_MODE15_0                 0x40000000U
#define GPIO_MODER_MODE15_1                 0x80000000U

/* Legacy defines */
#define GPIO_MODER_MODER0_Pos       (0U)                                       
#define GPIO_MODER_MODER0_Msk       (0x3UL << GPIO_MODER_MODER0_Pos)            /*!< 0x00000003 */
#define GPIO_MODER_MODER0           GPIO_MODER_MODER0_Msk                      
#define GPIO_MODER_MODER0_0         (0x1UL << GPIO_MODER_MODER0_Pos)            /*!< 0x00000001 */
#define GPIO_MODER_MODER0_1         (0x2UL << GPIO_MODER_MODER0_Pos)            /*!< 0x00000002 */
#define GPIO_MODER_MODER1_Pos       (2U)                                       
#define GPIO_MODER_MODER1_Msk       (0x3UL << GPIO_MODER_MODER1_Pos)            /*!< 0x0000000C */
#define GPIO_MODER_MODER1           GPIO_MODER_MODER1_Msk                      
#define GPIO_MODER_MODER1_0         (0x1UL << GPIO_MODER_MODER1_Pos)            /*!< 0x00000004 */
#define GPIO_MODER_MODER1_1         (0x2UL << GPIO_MODER_MODER1_Pos)            /*!< 0x00000008 */
#define GPIO_MODER_MODER2_Pos       (4U)                                       
#define GPIO_MODER_MODER2_Msk       (0x3UL << GPIO_MODER_MODER2_Pos)            /*!< 0x00000030 */
#define GPIO_MODER_MODER2           GPIO_MODER_MODER2_Msk                      
#define GPIO_MODER_MODER2_0         (0x1UL << GPIO_MODER_MODER2_Pos)            /*!< 0x00000010 */
#define GPIO_MODER_MODER2_1         (0x2UL << GPIO_MODER_MODER2_Pos)            /*!< 0x00000020 */
#define GPIO_MODER_MODER3_Pos       (6U)                                       
#define GPIO_MODER_MODER3_Msk       (0x3UL << GPIO_MODER_MODER3_Pos)            /*!< 0x000000C0 */
#define GPIO_MODER_MODER3           GPIO_MODER_MODER3_Msk                      
#define GPIO_MODER_MODER3_0         (0x1UL << GPIO_MODER_MODER3_Pos)            /*!< 0x00000040 */
#define GPIO_MODER_MODER3_1         (0x2UL << GPIO_MODER_MODER3_Pos)            /*!< 0x00000080 */
#define GPIO_MODER_MODER4_Pos       (8U)                                       
#define GPIO_MODER_MODER4_Msk       (0x3UL << GPIO_MODER_MODER4_Pos)            /*!< 0x00000300 */
#define GPIO_MODER_MODER4           GPIO_MODER_MODER4_Msk                      
#define GPIO_MODER_MODER4_0         (0x1UL << GPIO_MODER_MODER4_Pos)            /*!< 0x00000100 */
#define GPIO_MODER_MODER4_1         (0x2UL << GPIO_MODER_MODER4_Pos)            /*!< 0x00000200 */
#define GPIO_MODER_MODER5_Pos       (10U)                                      
#define GPIO_MODER_MODER5_Msk       (0x3UL << GPIO_MODER_MODER5_Pos)            /*!< 0x00000C00 */
#define GPIO_MODER_MODER5           GPIO_MODER_MODER5_Msk                      
#define GPIO_MODER_MODER5_0         (0x1UL << GPIO_MODER_MODER5_Pos)            /*!< 0x00000400 */
#define GPIO_MODER_MODER5_1         (0x2UL << GPIO_MODER_MODER5_Pos)            /*!< 0x00000800 */
#define GPIO_MODER_MODER6_Pos       (12U)                                      
#define GPIO_MODER_MODER6_Msk       (0x3UL << GPIO_MODER_MODER6_Pos)            /*!< 0x00003000 */
#define GPIO_MODER_MODER6           GPIO_MODER_MODER6_Msk                      
#define GPIO_MODER_MODER6_0         (0x1UL << GPIO_MODER_MODER6_Pos)            /*!< 0x00001000 */
#define GPIO_MODER_MODER6_1         (0x2UL << GPIO_MODER_MODER6_Pos)            /*!< 0x00002000 */
#define GPIO_MODER_MODER7_Pos       (14U)                                      
#define GPIO_MODER_MODER7_Msk       (0x3UL << GPIO_MODER_MODER7_Pos)            /*!< 0x0000C000 */
#define GPIO_MODER_MODER7           GPIO_MODER_MODER7_Msk                      
#define GPIO_MODER_MODER7_0         (0x1UL << GPIO_MODER_MODER7_Pos)            /*!< 0x00004000 */
#define GPIO_MODER_MODER7_1         (0x2UL << GPIO_MODER_MODER7_Pos)            /*!< 0x00008000 */
#define GPIO_MODER_MODER8_Pos       (16U)                                      
#define GPIO_MODER_MODER8_Msk       (0x3UL << GPIO_MODER_MODER8_Pos)            /*!< 0x00030000 */
#define GPIO_MODER_MODER8           GPIO_MODER_MODER8_Msk                      
#define GPIO_MODER_MODER8_0         (0x1UL << GPIO_MODER_MODER8_Pos)            /*!< 0x00010000 */
#define GPIO_MODER_MODER8_1         (0x2UL << GPIO_MODER_MODER8_Pos)            /*!< 0x00020000 */
#define GPIO_MODER_MODER9_Pos       (18U)                                      
#define GPIO_MODER_MODER9_Msk       (0x3UL << GPIO_MODER_MODER9_Pos)            /*!< 0x000C0000 */
#define GPIO_MODER_MODER9           GPIO_MODER_MODER9_Msk                      
#define GPIO_MODER_MODER9_0         (0x1UL << GPIO_MODER_MODER9_Pos)            /*!< 0x00040000 */
#define GPIO_MODER_MODER9_1         (0x2UL << GPIO_MODER_MODER9_Pos)            /*!< 0x00080000 */
#define GPIO_MODER_MODER10_Pos      (20U)                                      
#define GPIO_MODER_MODER10_Msk      (0x3UL << GPIO_MODER_MODER10_Pos)           /*!< 0x00300000 */
#define GPIO_MODER_MODER10          GPIO_MODER_MODER10_Msk                     
#define GPIO_MODER_MODER10_0        (0x1UL << GPIO_MODER_MODER10_Pos)           /*!< 0x00100000 */
#define GPIO_MODER_MODER10_1        (0x2UL << GPIO_MODER_MODER10_Pos)           /*!< 0x00200000 */
#define GPIO_MODER_MODER11_Pos      (22U)                                      
#define GPIO_MODER_MODER11_Msk      (0x3UL << GPIO_MODER_MODER11_Pos)           /*!< 0x00C00000 */
#define GPIO_MODER_MODER11          GPIO_MODER_MODER11_Msk                     
#define GPIO_MODER_MODER11_0        (0x1UL << GPIO_MODER_MODER11_Pos)           /*!< 0x00400000 */
#define GPIO_MODER_MODER11_1        (0x2UL << GPIO_MODER_MODER11_Pos)           /*!< 0x00800000 */
#define GPIO_MODER_MODER12_Pos      (24U)                                      
#define GPIO_MODER_MODER12_Msk      (0x3UL << GPIO_MODER_MODER12_Pos)           /*!< 0x03000000 */
#define GPIO_MODER_MODER12          GPIO_MODER_MODER12_Msk                     
#define GPIO_MODER_MODER12_0        (0x1UL << GPIO_MODER_MODER12_Pos)           /*!< 0x01000000 */
#define GPIO_MODER_MODER12_1        (0x2UL << GPIO_MODER_MODER12_Pos)           /*!< 0x02000000 */
#define GPIO_MODER_MODER13_Pos      (26U)                                      
#define GPIO_MODER_MODER13_Msk      (0x3UL << GPIO_MODER_MODER13_Pos)           /*!< 0x0C000000 */
#define GPIO_MODER_MODER13          GPIO_MODER_MODER13_Msk                     
#define GPIO_MODER_MODER13_0        (0x1UL << GPIO_MODER_MODER13_Pos)           /*!< 0x04000000 */
#define GPIO_MODER_MODER13_1        (0x2UL << GPIO_MODER_MODER13_Pos)           /*!< 0x08000000 */
#define GPIO_MODER_MODER14_Pos      (28U)                                      
#define GPIO_MODER_MODER14_Msk      (0x3UL << GPIO_MODER_MODER14_Pos)           /*!< 0x30000000 */
#define GPIO_MODER_MODER14          GPIO_MODER_MODER14_Msk                     
#define GPIO_MODER_MODER14_0        (0x1UL << GPIO_MODER_MODER14_Pos)           /*!< 0x10000000 */
#define GPIO_MODER_MODER14_1        (0x2UL << GPIO_MODER_MODER14_Pos)           /*!< 0x20000000 */
#define GPIO_MODER_MODER15_Pos      (30U)                                      
#define GPIO_MODER_MODER15_Msk      (0x3UL << GPIO_MODER_MODER15_Pos)           /*!< 0xC0000000 */
#define GPIO_MODER_MODER15          GPIO_MODER_MODER15_Msk                     
#define GPIO_MODER_MODER15_0        (0x1UL << GPIO_MODER_MODER15_Pos)           /*!< 0x40000000 */
#define GPIO_MODER_MODER15_1        (0x2UL << GPIO_MODER_MODER15_Pos)           /*!< 0x80000000 */

/******************  Bits definition for GPIO_OTYPER register  ****************/
#define GPIO_OTYPER_OT0                     0x00000001U
#define GPIO_OTYPER_OT1                     0x00000002U
#define GPIO_OTYPER_OT2                     0x00000004U
#define GPIO_OTYPER_OT3                     0x00000008U
#define GPIO_OTYPER_OT4                     0x00000010U
#define GPIO_OTYPER_OT5                     0x00000020U
#define GPIO_OTYPER_OT6                     0x00000040U
#define GPIO_OTYPER_OT7                     0x00000080U
#define GPIO_OTYPER_OT8                     0x00000100U
#define GPIO_OTYPER_OT9                     0x00000200U
#define GPIO_OTYPER_OT10                    0x00000400U
#define GPIO_OTYPER_OT11                    0x00000800U
#define GPIO_OTYPER_OT12                    0x00001000U
#define GPIO_OTYPER_OT13                    0x00002000U
#define GPIO_OTYPER_OT14                    0x00004000U
#define GPIO_OTYPER_OT15                    0x00008000U

